app/controllers/brew_types_controller.rb

  def index
    @brew_types = BrewType.all
---
SELECT "brew_types".* FROM "brew_types"

  def create
    @brew_type = BrewType.new(brew_type_params)

    respond_to do |format|
      if @brew_type.save
---
INSERT INTO "brew_types" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def set_brew_type
      @brew_type = BrewType.find(params[:id])
---
SELECT  "brew_types".* FROM "brew_types" WHERE "brew_types"."id" = ? LIMIT 1  [["id", 1]]