app/controllers/standards_controller.rb

SELECT "standards".* FROM "standards"
---
  def index
    @standards = Standard.all

INSERT INTO "standards" ("style", "color", "aroma", "taste", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @standard = Standard.new(standard_params)

    respond_to do |format|
      if @standard.save

UPDATE "standards" SET "aroma" = ?, "updated_at" = ? WHERE "standards"."id" = ?  [["aroma", "Floral - Hoppy"], ["updated_at", "2015-03-03 21:55:38.350637"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @standard.update(standard_params)

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_standard
      @standard = Standard.find(params[:id])